clear all
close all

comp=[
6.3307-0.174915i
-1.33539-0.03044i
3.61896-0.260459i
1.87513-0.323974i
-1.08561-0.136055i
3.99114-0.101864i
-4.10184+0.130571i
1.55399+0.0977916i
-2.1258-0.306485i
-3.27873-0.0544436i
0.241218+0.0962379i
-5.74708+0.0186908i
-0.0165977+0.237493i
-3.28921-0.188478i
-1.31227-0.120636i
0.745251-0.0679575i
-1.77199-0.416229i
2.56419-0.270373i
0.21325-0.232544i
2.23409+0.236383i
2.2949+0.173061i
1.09186+0.140938i
2.29353+0.442044i
0.695823+0.509325i
0.759858+0.417967i
-0.354267+0.506891i
-0.594517+0.39708i
-1.88618+0.649179i
-1.39041+0.867086i
-3.06381+0.422965i
-2.0433+0.0825514i
-2.1628-0.0933218i];
rng(4)
N = 32;             %数据长度
f1=0.05;
f2=0.40;    %更改相近频率的值 实验更改为0.40 和0.44 进行观察
f3=0.42;
noiseAmp = 0.1;     %更改噪声的幅度为 实验更改为0.8 0.5 
t=[0:1:N-1];
s1 = sin(2*pi*f1*t);
s2 = sin(2*pi*f2*t);
s3 = sin(2*pi*f3*t);
n = randn(1, N) + i * randn(1, N);
n=n*noiseAmp;
s = s1 + s2 + s3 + n;%%更改信号幅度 在不同的信号前面乘以相应的系数
% 我们让频率为0.4的幅度为A1，0.42的幅度为A2。实验更改为1 1.5和 1 2两种情况进行观察。
s = s';

a=1;
ar=1;
%test1 = comp;
test1 = s;
rtest = rot90(test1);
if a==1
%----------------------------------------------------
%----------------------------------------------------
figure(1)
ra=pper(rtest,10000);
subplot(2,1,1);
plot(10*log10(ra));
ylabel('PSD(dB)');
title('周期图谱估计')

rb=pacf(rtest,10000);
subplot(2,1,2);
plot(10*log10(rb));
ylabel('PSD(dB)');
title('由自相关序列算周期图谱估计(两者等价)')
end

if ar==1
%----------------------------------------------------
%----------------------------------------------------


[re,var1]=pcorr(rtest,10,10000);
figure(4);
subplot(2,1,1)
% plot(10*log10(re));
plot(re);
title('自相关法 IP=10');
ylabel('PSD');
hold on
[re,var2]=pcorr(rtest,15,10000);
figure(4);
subplot(2,1,2)
% plot(10*log10(re));
plot((re));
title('自相关法 IP=15');
ylabel('PSD');
%%%%绘制p阶数与最小预测误差之间图像部分代码
% var2=zeros(1,100);
% for i=1:100
% [re,var2(1,i)]=pcorr(rtest,i,10000);
% end
% x=1:100
% y=var2(1,x)
% plot(x,y)
% title('p与最小预测误差之间的变化图像');
% xlabel('p阶数')
%return;
end
